
<details><summary>Show Format output</summary>

```terraform

main.tf
rds.tf
variables.tf
vpc.tf
::error::Terraform exited with code 3.
```

</details>

<details><summary>Show Init output</summary>

```terraform

[0m[1mInitializing HCP Terraform...[0m
[0m[1mInitializing provider plugins...[0m
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v5.80.0...
- Installed hashicorp/aws v5.80.0 (signed by HashiCorp)
Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mHCP Terraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with HCP Terraform. Try running "terraform plan" to
see any changes that are required for your infrastructure.

If you ever set or change modules or Terraform Settings, run "terraform init"
again to reinitialize your working directory.[0m
```

</details>

<details><summary>Show Validate output</summary>

```terraform

Success! The configuration is valid.
```

</details>

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/postech-fiap-alura/totem-express/runs/run-QQYL1gLi2FvkHyA7

Waiting for the plan to start...

Terraform v1.10.0
on linux_amd64
Initializing plugins and modules...
data.aws_availability_zones.available: Refreshing...
aws_vpc.totem_express_db_vpc: Refreshing state... [id=vpc-0bf01b4692d2af782]
data.aws_availability_zones.available: Refresh complete after 1s [id=us-east-1]
aws_subnet.totem_express_db_subnet[0]: Refreshing state... [id=subnet-050eb2566d2327142]
aws_subnet.totem_express_db_subnet[1]: Refreshing state... [id=subnet-0f1e5f837057ce915]
aws_security_group.db_sg: Refreshing state... [id=sg-03f7e989bbf6d7e3a]
aws_db_subnet_group.default: Refreshing state... [id=totex-express-db-subnet-group]
aws_vpc.totem_express_db_vpc: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_instance.default will be created
  + resource "aws_db_instance" "default" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = (known after apply)
      + db_subnet_group_name                  = "totex-express-db-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "8.4.3"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t2.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Name" = "totex-express-db"
        }
      + tags_all                              = {
          + "Name" = "totex-express-db"
        }
      + timezone                              = (known after apply)
      + username                              = "postech_admin"
      + vpc_security_group_ids                = [
          + "sg-03f7e989bbf6d7e3a",
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @JoaoHL, Action: `pull_request`*